{
  "App": {
    "Title": "RENAULT Kylian",
    "Presentation": {
      "FirstTitle": "Presentation",
      "Title": "Web & Mobile Developer",
      "Description": "Currently a fourth-year engineering student at CESI in Caen, I am actively seeking an internship starting on September 2, 2024, for my final year of studies. With a passion for computer science, I am currently working on developing a professional Web application template created with vueJS (frontend) and adonisJS (backend) that includes features such as authentication, email sending, logging, Cron, request limiting, Websockets, google authentification, etc. You can explore this project further at the following address:",
      "Resume": "Resume",
      "CoverLetter": "Cover Letter"
    },
    "Formation": {
      "Title": "Formations",
      "Website": "Learn more",
      "One": {
        "Title": "CESI Engineering School: Computer Science specialization",
        "Date": "Since September 2022",
        "Website": "https://www.cesi.fr/",
        "Description": "Automony, Teamwork, Network, Development, Project Management, English",
        "Location": "4 place boston - 14200 Hérouville-Saint-Clair"
      },
      "Two": {
        "Title": "Integrated preparatory class: Computer Science minor",
        "Date": "09/2020 - 07/2022",
        "Website": "https://www.cesi.fr/",
        "Description": "Group work,Mathematics,Computer science,Physics,English",
        "Location": "4 place boston - 14200 Hérouville-Saint-Clair"
      },
      "Three": {
        "Title": "First year of Bachelor's degree in Physics with computer science option",
        "Date": "09/2019 - 07/2020",
        "Website": "https://uniformsup.unicaen.fr/catalogue/formation/licences/5358-licence-physique?s=ufrdessciences&r=1485246625394",
        "Description": "Mathematics,Physics,Electricity,English",
        "Location": "Avenue de la Côte de Nacre - 14000 Caen"
      },
      "Four": {
        "Title": "Obtaining the baccalaureate diploma Series S option SVT",
        "Date": "09/2016 - 07/2019",
        "Website": "https://lycee-salvador-allende.etab.ac-caen.fr/",
        "Description": "Mathematics,Physics,English,Spanish,SVT,History,Geography,Philosophy",
        "Location": "15 Rue Guyon de Guercheville - 14200 Hérouville Saint Clair"
      }
    },
    "Experience": {
      "Title": "Professional experiences",
      "Website": "Learn more",
      "Eight": {
        "Title": "International Internship in Web Development/Python",
        "Date": "09/2023 - 01/2024",
        "Website": "https://www.resqplus.eu/partners/aalborg-university",
        "Description": "Developed a dashboard using the Shiny framework to identify areas for improvement in collaboration with esteemed professors such as Mr. HENDRIK KNOCHE and PhD like HAMZAH ZIADEH (Python). - Enhanced the existing dashboard in collaboration with doctors from across Europe who use it (R). - Implemented a chatbot using the Rasa framework to generate specific graphs tailored to the needs of physicians (Python)",
        "Location": "Aalborg University - 9000 Aalborg (Denmark)"
      },
      "Seven": {
        "Title": "Beach Club Animator (seasonal job)",
        "Date": "08/2023",
        "Website": "https://www.cabourg-plage.fr/",
        "Description": "Animator at a beach club, overseeing children aged 5 to 10.",
        "Location": "Croco Club Cabourg - 14390 Cabourg"
      },
      "One": {
        "Title": "Web/Mobile Developer Internship - Qwice",
        "Date": "01/2023 - 04/2023",
        "Website": "https://qwice.org/",
        "Description": "Making an existing web application compatible with native Android/iOS mobile application with the framework Capacitor.js(android studio / xcode). - Adding push notifications to the application (firebase / php). - Adding and correcting features on the frontend (VueJs).",
        "Location": "Normandie incubation - 14000 Caen"
      },
      "Two": {
        "Title": "Full Stack Developer Internship",
        "Date": "04/2022 - 08/2022",
        "Website": "https://boomerangweb.net/gestion-des-achats-bons-de-commande/",
        "Description": "Creation of a client management interface for server centralization (Laravel + Vue.js + MySQL). - Creation of bash scripts to determine the status of servers (bash). - Unit testing of the most critical functions (PHPUnit + Mockery).",
        "Location": "Boomerang Web - 14000 Caen"
      },
      "Three": {
        "Title": "Volunteer Fabmanager Assistant",
        "Date": "09/2021 - 01/2022",
        "Website": "https://www.facebook.com/lepavillonorb",
        "Description": "Basic computer courses (Word, Excel, PowerPoint, Internet, etc.) for beginners. - Use of fablab machines (3D printer, laser cutter, etc.).",
        "Location": "Sociocultural Center - Ouistreham"
      },
      "Four": {
        "Title": "Restaurant Employee (seasonal job)",
        "Date": "07/2019 - 09/2019",
        "Website": "https://festyland.com/",
        "Description": "Preparation of customer orders (in the kitchen). - Customer service. - Cleaning of premises.",
        "Location": "Festyland - 14652 Carpiquet"
      },
      "Five": {
        "Title": "Laborer (seasonal job)",
        "Date": "06/2020 - 08/2020",
        "Website": "https://www.maugergazmedicaux.fr/nos-services/vente-de-materiels-dalimentation-gaz-medicaux/",
        "Description": "Installation of medical oxygen and air pipes in hospitals. - Installation of medical oxygen and air wall outlets in hospitals. - Installation of medical oxygen and air plants in hospitals.",
        "Location": "Mauger Gaz Médicaux - 14460 Colombelles"
      },
      "Six": {
        "Title": "Laborer (seasonal job)",
        "Date": "08/2018",
        "Website": "https://www.maugergazmedicaux.fr/nos-services/vente-de-materiels-dalimentation-gaz-medicaux/",
        "Description": "Installation of medical oxygen and air pipes in hospitals. - Installation of medical oxygen and air wall outlets in hospitals. - Installation of medical oxygen and air plants in hospitals.",
        "Location": "Mauger Gaz Médicaux - 14460 Colombelles"
      }
    },
    "Project": {
      "Github": "My contributions on Github",
      "Title": "My Projects",
      "Show": "See description",
      "Hide": "Hide description",
      "Website": "Github",
      "One": {
        "Title": "Lahyra",
        "Date": "Since September 2023",
        "Website": "https://github.com/Gammelinne/Lahyra-back-V2",
        "Description": "Lahyra is my most significant personal project. It was built using VueJS (JavaScript) for the frontend and Laravel for the backend (PHP). This project encompasses a wide range of advanced features that make it robust and secure. - First and foremost, let's delve into the JWT (JSON Web Token) protected authentication. JWT is a highly popular authentication mechanism utilized in modern web applications. The primary advantage of JWT is its ability to maintain authentication state on the client side, eliminating the need for the server to store authentication state for each user. Instead, when a user successfully logs in, they receive a JWT token containing encoded credential information. This token is then included in every subsequent request sent to the server, enabling the server to authenticate and authorize the user for each request. - Moving on to language management with I18n, Lahyra has the capability to support multiple languages. This is a crucial feature for applications targeting an international audience as it allows users to select their preferred language. With this functionality, texts and messages displayed to the user can be easily and dynamically translated, providing a more personalized experience. - Another important feature of Lahyra is the ability to upload and store photos. Users can upload images to the site, which are then securely stored on a server or an appropriate storage service. This feature offers a convenient solution for users who want to share photos or images as part of their Lahyra experience. - Additionally, Lahyra integrates WebSocket with Pusher. WebSocket is a bidirectional communication protocol that enables real-time communication between the client and the server. By leveraging WebSocket in Lahyra, instant and real-time updates can be achieved without the need to refresh the page. This results in a more responsive user experience, especially for features that require real-time updates, such as notifications or live conversations. - Furthermore, by clicking on 'API Routes', users can access a comprehensive list of all the routes functioning on the site. Some of these routes are protected by administrator privileges, meaning they can only be accessed by users with administrative rights. This security measure ensures that certain sensitive or restricted features can only be utilized by authorized users, thereby enhancing the overall security of the application.",
        "Route": "API Routes",
        "Skills": "Laravel 10,Vuejs 3,Vuetify,Websocket,PHP 8.2,JWT,Pusher,I18n,Passport,Axios,LocalStorage,Git"
      },
      "Two": {
        "Title": "Portfolio",
        "Date": "June 2023",
        "Website": "https://github.com/Gammelinne/web_portfolio",
        "Description": "My portfolio is a personal project created using VueJS (JavaScript) with Vuetify. VueJS is a popular JavaScript framework for building user interfaces, and Vuetify is a UI component library that provides ready-to-use components following the Material Design guidelines. Together, VueJS and Vuetify offer a powerful combination for developing visually appealing and interactive web applications. - To enhance the functionality of the portfolio, various libraries have been incorporated. One of them is I18n, which stands for Internationalization. I18n allows for easy translation and localization of the portfolio into multiple languages. This feature is crucial for reaching a broader audience and providing a personalized experience to users who prefer different languages. - For handling HTTP requests, the portfolio utilizes Axios, a widely used JavaScript library. Axios simplifies the process of making asynchronous HTTP requests, such as retrieving data from APIs or sending data to a server. - To ensure smooth navigation within the portfolio, Vue Router is employed. Vue Router is the official routing library for VueJS. It enables the creation of dynamic, single-page applications with multiple views or pages. By utilizing Vue Router, the portfolio can have separate routes for different sections, allowing users to navigate between different pages without the need for full page reloads. - In addition to the functional aspects, the portfolio also features a dark mode system. Dark mode provides an alternative color scheme that uses darker colors, which can be easier on the eyes, reduce eye strain, and conserve device battery life. To provide a seamless experience for users, the selected mode (dark or light) is stored in the local storage of the user's browser. This means that even if the user refreshes the page or closes the browser, the portfolio remembers their preferred mode and applies it consistently.",
        "Skills": "Vuejs 3,Vuetify,I18n,Axios,Vue Router,LocalStorage,Git"
      },
      "Three": {
        "Title": "EasySave",
        "Date": "December 2022",
        "Website": "https://github.com/Gammelinne/Easysave",
        "Description": "EasySave is a file backup software that was developed as a school project by a team of 4 students. I was responsible for software development, with a specific focus on implementing the MVVM (Model-View-ViewModel) pattern. - During the development process, we utilized a range of tools and technologies. We worked with Visual Studio 2022 (Enterprise version), which provided a powerful and versatile integrated development environment. Visual Studio enabled us to create a robust and functional application, offering advanced debugging features, version control, and seamless integration with third-party tools. - For designing and modeling our application, we utilized Visual Paradigm, a visual modeling tool. This allowed us to create class diagrams, sequence diagrams, and other models to plan and organize our development effectively. - Regarding source code management and team collaboration, we leveraged Azure Repos, a Git repository hosting service provided by Microsoft. This facilitated collaborative work, enabling us to track code changes and effectively manage branches and project versions. - EasySave was developed as version 1.0, marking the initial release of the software. Throughout the development process, we prioritized creating a user-friendly interface while ensuring the reliability and security of file backups. - This project provided me with valuable experience in software development, team collaboration, and the utilization of modern development tools. I had the opportunity to apply the principles of the MVVM pattern, which promotes clear separation of responsibilities between business logic, presentation, and data management.",
        "Skills": "C#,WPF,Visual Studio 2022,Visual Paradigm,Azure Repos, Git"
      },
      "Four": {
        "Title": "Discord Bot",
        "Date": "February 2022",
        "Website": "https://github.com/Gammelinne/Bot-discord",
        "Description": "My first Discord bot is a project I undertook to learn the JavaScript programming language and explore application development on the Discord platform. To build this bot, I utilized the Discord.js library, which is specifically designed to interact with the Discord API. - I began by creating a bot account on the Discord Developer Portal, which provided me with a unique authentication token. This token is used by my bot to connect to Discord as a separate entity. - Next, I set up my development environment by installing Node.js, a platform that enables server-side execution of JavaScript applications. Node.js allowed me to run my bot as a standalone application capable of responding to events and commands on Discord servers. - Using Discord.js, I created custom features for my bot. For example, I implemented the 'interaction' command, which allows server administrators to view interactions taking place. - Another command I added is 'ban,' which allows for the banning of a member from the server. This command accepts two options: 'membre' to specify the member to be banned and 'raison' to provide an optional reason. - I also included the 'github' command, which displays a link to my source code on GitHub, and the 'serveur' command, which enables users to view various server-related information. - To add an element of fun to my bot, I created the 'al' command, which allows users to play the 'Guess the Number' game. This command accepts the 'numero' option, allowing the user to choose a number. - Another feature I implemented is the 'pof' command, which allows users to play the 'Heads or Tails' game. - The 'covid' command enables users to select COVID-19-related data. This command utilizes an external API to fetch up-to-date information. I used the fetch function to send a request to the API and retrieve information on COVID-19 deaths, individuals in intensive care, hospitalized individuals, or confirmed cases. Users can choose from these options using the 'donnees' option of the command. - The bot also includes the 'nasa' command, which displays the NASA 'Picture of the Day.' For this, I used another external API that provides NASA images. I also utilized the fetch function to retrieve the data for the daily image. - Lastly, I added the 'annonce' command, which allows for the posting of announcements. This command accepts the 'message' option, allowing users to enter the announcement message. - Through this project, I have gained a better understanding of the JavaScript language, as well as foundational concepts of object-oriented programming. I have also explored the Discord API, interactive bot creation features, and integration of external APIs to enhance my bot's functionality.",
        "Skills": "JavaScript,Node.js,Discord.js,Visual Studio Code,GitHub"
      },
      "Five": {
        "Title": "WebApp Template",
        "Date": "Since October 2023",
        "Website": "https://github.com/Gammelinne/backend-template-for-web-app",
        "Description": "WebApp Template is a comprehensive project that combines a powerful backend based on AdonisJS with a dynamic frontend built with VueJS. This integration provides a robust solution for the development of modern web applications. Key features include: - Secure Authentication: Utilizing JSON Web Token (JWT) to maintain client-side authentication state. This provides enhanced security without the need to store authentication state on the server. - Multilingual Support (I18n): Integrated multilingual support allows users to choose their preferred language. Texts and messages are dynamically translated, providing a personalized user experience. - Secure Image Storage: Users can upload images, securely stored on a server or an appropriate storage service. This facilitates image sharing as part of the application usage. - WebSocket with Pusher: WebSocket integration for real-time updates. Features like notifications and live chats are enhanced with instant updates, eliminating the need for page reloading. - Secured API Routes: Some routes are protected by administrator permissions, ensuring that sensitive features are only accessible to authorized users. - The backend, built with AdonisJS, offers advanced user management, strengthened security with hashed passwords, automatic log rotation, and a rate-limiting mechanism to prevent spam. Migrations and seeders facilitate database management, while project organization follows the MVC model for optimal maintenance and extensibility.",
        "Embed": "https://Lahyra.fr",
        "Skills": "AdonisJS, Vue.js, Vuetify, WebSockets, JWT, Pusher, I18n, Passport, Axios, LocalStorage, Git, RESTful APIs, GraphQL, Docker, Continuous Integration, Unit Testing, End-to-End Testing"
      }
    },
    "Hobbies": {
      "Title": "My Hobbies",
      "One": {
        "Title": "Music",
        "Description": "Since the age of 6, I have been enrolled in the Ouistreham Music School. I started with two years of musical initiation, and it was during my second year that I discovered the instrument I still practice today: the drums. In my sophomore year, I had the incredible opportunity to join the junior orchestra of the community center, which allowed me to perform in more significant venues such as the CHU de Caen, the Fête de la Musique, and even abroad in Germany. For the past four years, I have been part of the contemporary music scene in Ouistreham. Throughout these four years, we have had the opportunity to perform in several concerts. Here is a demo of our rendition of Radiohead's 'No Surprise' :"
      },
      "Two": {
        "Title": "Judo / Taïso",
        "Description": "I have been practicing judo since the age of 7 and currently hold a brown belt. I am deeply committed to my club and participate in various events such as refereeing or the telethon, as shown in the photo below from the 2021 telethon."
      }
    },
    "Contact": {
      "Title": "Contact Me",
      "Description": "If you wish to contact me, you can do so directly via my email or using the form below:",
      "Name": "Name",
      "Email": "Email",
      "Message": "Message",
      "Submit": "Submit",
      "Success": "Your message has been successfully sent!",
      "GeneralError": "Please fill in all the fields.",
      "EmailError": "Please enter a valid email address.",
      "CriticError": "An error occurred on my side, please try again later.",
      "Info": {
        "Title": "My informations",
        "Birthday": "14 August 2001"
      }
    },
    "TemplateRoutes": {
      "Title": "API Routes",
      "Table": {
        "Method": "Method",
        "Endpoint": "Endpoint",
        "Description": "Description"
      },
      "1": {
        "Method": "GET",
        "Endpoint": "/users/me",
        "Description": "Retrieves information about the currently authenticated user."
      },
      "2": {
        "Method": "PUT",
        "Endpoint": "/users/update",
        "Description": "Updates user information."
      },
      "3": {
        "Method": "DELETE",
        "Endpoint": "/users/delete",
        "Description": "Deletes user account."
      },
      "4": {
        "Method": "POST",
        "Endpoint": "/register",
        "Description": "Registers a new user."
      },
      "5": {
        "Method": "POST",
        "Endpoint": "/login",
        "Description": "Logs in a user."
      },
      "6": {
        "Method": "POST",
        "Endpoint": "/reset-password",
        "Description": "Initiates the password reset process."
      },
      "7": {
        "Method": "POST",
        "Endpoint": "/logout",
        "Description": "Logs out the authenticated user."
      },
      "8": {
        "Method": "GET",
        "Endpoint": "/verify-email/:email",
        "Description": "Verifies the user's email address."
      },
      "9": {
        "Method": "POST",
        "Endpoint": "/resend-verification-email",
        "Description": "Resends the verification email."
      },
      "10": {
        "Method": "POST",
        "Endpoint": "/reset-password-email",
        "Description": "Sends a reset password email."
      },
      "11": {
        "Method": "GET",
        "Endpoint": "/posts",
        "Description": "Retrieves a list of posts."
      },
      "12": {
        "Method": "GET",
        "Endpoint": "/posts/:id",
        "Description": "Retrieves details of a specific post."
      },
      "13": {
        "Method": "POST",
        "Endpoint": "/posts",
        "Description": "Creates a new post."
      },
      "14": {
        "Method": "PUT",
        "Endpoint": "/posts/:id",
        "Description": "Updates a specific post."
      },
      "15": {
        "Method": "DELETE",
        "Endpoint": "/posts/:id",
        "Description": "Deletes a specific post."
      },
      "16": {
        "Method": "POST",
        "Endpoint": "/google/redirect",
        "Description": "Handles Google OAuth2 redirection."
      }
    },    
    "LahyraRoutes": {
      "Title": "API Routes",
      "Table": {
        "Method": "Method",
        "Endpoint": "Endpoint",
        "Description": "Description"
      },
      "1": {
        "Method": "GET",
        "Endpoint": "/laravel-websockets",
        "Description": "Retrieves information about the Laravel WebSockets."
      },
      "2": {
        "Method": "HEAD",
        "Endpoint": "/laravel-websockets",
        "Description": "Retrieves the headers for the Laravel WebSockets."
      },
      "3": {
        "Method": "GET",
        "Endpoint": "/laravel-websockets/apps",
        "Description": "Retrieves information about the Laravel WebSockets apps."
      },
      "4": {
        "Method": "HEAD",
        "Endpoint": "/laravel-websockets/apps",
        "Description": "Retrieves the headers for the Laravel WebSockets apps."
      },
      "5": {
        "Method": "POST",
        "Endpoint": "/laravel-websockets/apps",
        "Description": "Creates a new Laravel WebSockets app."
      },
      "6": {
        "Method": "GET",
        "Endpoint": "/laravel-websockets/api/{appId}/statistics",
        "Description": "Retrieves statistics for a specific Laravel WebSockets app."
      },
      "7": {
        "Method": "HEAD",
        "Endpoint": "/laravel-websockets/api/{appId}/statistics",
        "Description": "Retrieves the headers for the statistics of a specific Laravel WebSockets app."
      },
      "8": {
        "Method": "POST",
        "Endpoint": "/laravel-websockets/auth",
        "Description": "Authenticates using Laravel WebSockets."
      },
      "9": {
        "Method": "POST",
        "Endpoint": "/laravel-websockets/event",
        "Description": "Sends an event using Laravel WebSockets."
      },
      "10": {
        "Method": "POST",
        "Endpoint": "/oauth/token",
        "Description": "Requests an OAuth token."
      },
      "11": {
        "Method": "GET",
        "Endpoint": "/oauth/authorize",
        "Description": "Authorizes an OAuth request."
      },
      "12": {
        "Method": "HEAD",
        "Endpoint": "/oauth/authorize",
        "Description": "Retrieves the headers for the OAuth authorization request."
      },
      "13": {
        "Method": "POST",
        "Endpoint": "/oauth/token/refresh",
        "Description": "Refreshes an OAuth token."
      },
      "14": {
        "Method": "POST",
        "Endpoint": "/oauth/authorize",
        "Description": "Creates an OAuth authorization request."
      },
      "15": {
        "Method": "DELETE",
        "Endpoint": "/oauth/authorize",
        "Description": "Deletes an OAuth authorization request."
      },
      "16": {
        "Method": "GET",
        "Endpoint": "/oauth/tokens",
        "Description": "Retrieves OAuth tokens."
      },
      "17": {
        "Method": "HEAD",
        "Endpoint": "/oauth/tokens",
        "Description": "Retrieves the headers for OAuth tokens."
      },
      "18": {
        "Method": "DELETE",
        "Endpoint": "/oauth/tokens/{token_id}",
        "Description": "Deletes a specific OAuth token."
      },
      "19": {
        "Method": "GET",
        "Endpoint": "/oauth/clients",
        "Description": "Retrieves OAuth clients."
      },
      "20": {
        "Method": "HEAD",
        "Endpoint": "/oauth/clients",
        "Description": "Retrieves the headers for OAuth clients."
      },
      "21": {
        "Method": "POST",
        "Endpoint": "/oauth/clients",
        "Description": "Creates an OAuth client."
      },
      "22": {
        "Method": "PUT",
        "Endpoint": "/oauth/clients/{client_id}",
        "Description": "Updates an OAuth client."
      },
      "23": {
        "Method": "DELETE",
        "Endpoint": "/oauth/clients/{client_id}",
        "Description": "Deletes a specific OAuth client."
      },
      "24": {
        "Method": "GET",
        "Endpoint": "/oauth/scopes",
        "Description": "Retrieves OAuth scopes."
      },
      "25": {
        "Method": "HEAD",
        "Endpoint": "/oauth/scopes",
        "Description": "Retrieves the headers for OAuth scopes."
      },
      "26": {
        "Method": "GET",
        "Endpoint": "/oauth/personal-access-tokens",
        "Description": "Retrieves personal access tokens."
      },
      "27": {
        "Method": "HEAD",
        "Endpoint": "/oauth/personal-access-tokens",
        "Description": "Retrieves the headers for personal access tokens."
      },
      "28": {
        "Method": "POST",
        "Endpoint": "/oauth/personal-access-tokens",
        "Description": "Creates a personal access token."
      },
      "29": {
        "Method": "DELETE",
        "Endpoint": "/oauth/personal-access-tokens/{token_id}",
        "Description": "Deletes a specific personal access token."
      },
      "30": {
        "Method": "GET",
        "Endpoint": "/broadcasting/auth",
        "Description": "Retrieves authentication information for broadcasting."
      },
      "31": {
        "Method": "POST",
        "Endpoint": "/broadcasting/auth",
        "Description": "Authenticates for broadcasting."
      },
      "32": {
        "Method": "HEAD",
        "Endpoint": "/broadcasting/auth",
        "Description": "Retrieves the headers for broadcasting authentication."
      },
      "33": {
        "Method": "POST",
        "Endpoint": "/api/user",
        "Description": "Creates a new user in the API."
      },
      "34": {
        "Method": "GET",
        "Endpoint": "/api/user",
        "Description": "Retrieves information about a user in the API."
      }
    }
  }
}